app/views/books/edit.html.erb

SELECT "authors".* FROM "authors"
---
        <%= form.label :author_id %>
        <%= form.select :author_id, Author.all.map { |author| [author.name, author.id] } %>