app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "updated_at", "name", "email") VALUES ('2024-12-28 17:17:25.615262', '2024-12-28 17:17:25.615262', 'Pravin', 'pravin@gmail.com') RETURNING "id"
---
    def create
        @author = Author.new(author_params)

        if @author.save