app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "updated_at", "title", "description", "author_id") VALUES ('2024-12-28 17:20:53.684643', '2024-12-28 17:20:53.684643', 'Book 2', 'Desc of Book 2', 1) RETURNING "id"
---
    def create
        @book = Book.new(book_params)

        if @book.save

UPDATE "books" SET "updated_at" = '2024-12-28 17:34:52.485148', "title" = 'Book of 2' WHERE "books"."id" = 2
---
    def update
        if @book.update(book_params)